[{
    "tag": "Bahadurgarh Properties",
    "patterns": [
        "What residential options are available in Bahadurgarh?",
        "Can you provide details about properties in Bahadurgarh?",
        "Tell me about housing options in Bahadurgarh.",
        "I'm interested in properties in Bahadurgarh. What are my options?",
        "What types of apartments are available in Bahadurgarh?",
        "Show me the available residential properties in Bahadurgarh.",
        "I'm looking for a place in Bahadurgarh. What are my choices?",
        "What are the housing possibilities in Bahadurgarh?",
        "Tell me about the real estate scene in Bahadurgarh.",
        "List the residential properties available in Bahadurgarh.",
        "What are the current residential developments in Bahadurgarh?",
        "Could you give me an overview of the housing market in Bahadurgarh?",
        "Which residential projects are popular in Bahadurgarh?",
        "What are some recommended neighborhoods for buying property in Bahadurgarh?",
        "Are there any upcoming residential projects in Bahadurgarh?",
        "What are the price trends for residential properties in Bahadurgarh?",
        "Could you suggest some budget-friendly housing options in Bahadurgarh?",
        "What amenities are commonly found in residential properties in Bahadurgarh?",
        "Can you recommend some gated communities in Bahadurgarh?",
        "Are there any luxury residential options available in Bahadurgarh?",
        "What are the typical sizes of residential units in Bahadurgarh?",
        "How is the demand for residential properties in Bahadurgarh?",
        "Are there any eco-friendly housing options in Bahadurgarh?",
        "What should I consider before investing in a property in Bahadurgarh?",
        "Could you provide information on rental properties in Bahadurgarh?",
        "What are the legal aspects to consider when buying property in Bahadurgarh?"
    ],
    "responses": [
        "Omaxe North Avenue II: 3BHK & 3BHK + Servant Room Apartments, Omaxe Royal Street: 3BHK Apartments, Omaxe Shubhangan: 1BHK, 2BHK, 3BHK & 4BHK Apartments, Omaxe North Avenue: 2BHK Apartment, Omaxe City Homes: 3BHK Apartments"
    ]
},
{
    "tag": "Vrindavan Properties",
    "patterns": [
        "What residential options are available in Vrindavan?",
        "Can you provide details about properties in Vrindavan?",
        "Tell me about housing options in Vrindavan.",
        "I'm interested in properties in Vrindavan. What are my options?",
        "What types of apartments are available in Vrindavan?",
        "Show me the available residential properties in Vrindavan.",
        "I'm looking for a place in Vrindavan. What are my choices?",
        "What are the housing possibilities in Vrindavan?",
        "Tell me about the real estate scene in Vrindavan.",
        "List the residential properties available in Vrindavan.",
        "What are the current residential developments in Vrindavan?",
        "Could you give me an overview of the housing market in Vrindavan?",
        "Which residential projects are popular in Vrindavan?",
        "What are some recommended neighborhoods for buying property in Vrindavan?",
        "Are there any upcoming residential projects in Vrindavan?",
        "What are the price trends for residential properties in Vrindavan?",
        "Could you suggest some budget-friendly housing options in Vrindavan?",
        "What amenities are commonly found in residential properties in Vrindavan?",
        "Can you recommend some gated communities in Vrindavan?",
        "Are there any luxury residential options available in Vrindavan?",
        "What are the typical sizes of residential units in Vrindavan?",
        "How is the demand for residential properties in Vrindavan?",
        "Are there any eco-friendly housing options in Vrindavan?",
        "What should I consider before investing in a property in Vrindavan?",
        "Could you provide information on rental properties in Vrindavan?",
        "What are the legal aspects to consider when buying property in Vrindavan?"
    ],
    "responses": [
        "Krishna Crest: Service Apartments, Omaxe Full Moon: 1BHK+Study, 2BHK+Study & 3BHK, Omaxe Eternity: 2 BHK, & Studio Apartments, Krishna Castle: Studio Apartments, 1- Bed Room"
    ]
},
{
    "tag": "Gurugram Properties",
    "patterns": [
        "What residential options are available in Gurugram?",
        "Can you provide details about properties in Gurugram?",
        "Tell me about housing options in Gurugram.",
        "I'm interested in properties in Gurugram. What are my options?",
        "What types of apartments are available in Gurugram?",
        "Show me the available residential properties in Gurugram.",
        "I'm looking for a place in Gurugram. What are my choices?",
        "What are the housing possibilities in Gurugram?",
        "Tell me about the real estate scene in Gurugram.",
        "List the residential properties available in Gurugram.",
        "What are the current residential developments in Gurugram?",
        "Could you give me an overview of the housing market in Gurugram?",
        "Which residential projects are popular in Gurugram?",
        "What are some recommended neighborhoods for buying property in Gurugram?",
        "Are there any upcoming residential projects in Gurugram?",
        "What are the price trends for residential properties in Gurugram?",
        "Could you suggest some budget-friendly housing options in Gurugram?",
        "What amenities are commonly found in residential properties in Gurugram?",
        "Can you recommend some gated communities in Gurugram?",
        "Are there any luxury residential options available in Gurugram?",
        "What are the typical sizes of residential units in Gurugram?",
        "How is the demand for residential properties in Gurugram?",
        "Are there any eco-friendly housing options in Gurugram?",
        "What should I consider before investing in a property in Gurugram?",
        "Could you provide information on rental properties in Gurugram?",
        "What are the legal aspects to consider when buying property in Gurugram?"
    ],
    "responses": [
        "Mayfield Garden Designer Villas: Villas, Independent floor, Omaxe Olive Apartments I & II: 3 BHK Apartments, Suncity Executive Floors: Independent Floors, South Avenue Executive Floors: 3 BHK Flats & Luxury Apartments, Sushant Lok II Executive Floors: Independent 3BHK Floors, Omaxe The Nile: Multistorey Apartments - 3BHK,4BHK Appartments"
    ]
},
{
    "tag": "Noida Properties",
    "patterns": [
        "What residential options are available in Noida?",
        "Can you provide details about properties in Noida?",
        "Tell me about housing options in Noida.",
        "I'm interested in properties in Noida. What are my options?",
        "What types of apartments are available in Noida?",
        "Show me the available residential properties in Noida.",
        "I'm looking for a place in Noida. What are my choices?",
        "What are the housing possibilities in Noida?",
        "Tell me about the real estate scene in Noida.",
        "List the residential properties available in Noida.",
        "What are the current residential developments in Noida?",
        "Could you give me an overview of the housing market in Noida?",
        "Which residential projects are popular in Noida?",
        "What are some recommended neighborhoods for buying property in Noida?",
        "Are there any upcoming residential projects in Noida?",
        "What are the price trends for residential properties in Noida?",
        "Could you suggest some budget-friendly housing options in Noida?",
        "What amenities are commonly found in residential properties in Noida?",
        "Can you recommend some gated communities in Noida?",
        "Are there any luxury residential options available in Noida?",
        "What are the typical sizes of residential units in Noida?",
        "How is the demand for residential properties in Noida?",
        "Are there any eco-friendly housing options in Noida?",
        "What should I consider before investing in a property in Noida?",
        "Could you provide information on rental properties in Noida?",
        "What are the legal aspects to consider when buying property in Noida?"
    ],
    "responses": [
        "Omaxe Royal Residency: 3/4 BHK Apartments, Omaxe Twin Towers: 3/4BHK Apartments, Grand Omaxe: 2BHK, 3BHK & 3BHK+SR, The Forest Spa: 3/4BHK Apartments, The Forest: 4-BHK, 5-BHK & Penthouses"
    ]
},
{
    "tag": "Greater Noida Properties",
    "patterns": [
        "What residential options are available in Greater Noida?",
        "Can you provide details about properties in Greater Noida?",
        "Tell me about housing options in Greater Noida.",
        "I'm interested in properties in Greater Noida. What are my options?",
        "What types of apartments are available in Greater Noida?",
        "Show me the available residential properties in Greater Noida.",
        "I'm looking for a place in Greater Noida. What are my choices?",
        "What are the housing possibilities in Greater Noida?",
        "Tell me about the real estate scene in Greater Noida.",
        "List the residential properties available in Greater Noida.",
        "What are the current residential developments in Greater Noida?",
        "Could you give me an overview of the housing market in Greater Noida?",
        "Which residential projects are popular in Greater Noida?",
        "What are some recommended neighborhoods for buying property in Greater Noida?",
        "Are there any upcoming residential projects in Greater Noida?",
        "What are the price trends for residential properties in Greater Noida?",
        "Could you suggest some budget-friendly housing options in Greater Noida?",
        "What amenities are commonly found in residential properties in Greater Noida?",
        "Can you recommend some gated communities in Greater Noida?",
        "Are there any luxury residential options available in Greater Noida?",
        "What are the typical sizes of residential units in Greater Noida?",
        "How is the demand for residential properties in Greater Noida?",
        "Are there any eco-friendly housing options in Greater Noida?",
        "What should I consider before investing in a property in Greater Noida?",
        "Could you provide information on rental properties in Greater Noida?",
        "What are the legal aspects to consider when buying property in Greater Noida?"
    ],
    "responses": [
        "Omaxe Palm Greens: 2BHK, 3BHK, 3BHK+servant room, 4BHK+servant room, Orchid Avenue: 2BHK & 3BHK Apartments, Omaxe Palm Villas: 2BHK, 3BHK, 3BHK+SR & 4BHK+SR"
    ]
},
{
    "tag": "SEBI Disclosures",
    "patterns": [
        "Disclosures Under Regulation 46 of The SEBI (LODR) Regulations",
        "SEBI Disclosures",
        "What are the SEBI disclosures under Regulation 46?",
        "Can you provide information about SEBI disclosures?",
        "Tell me about SEBI disclosures under Regulation 46.",
        "I'm interested in learning more about SEBI disclosures."
    ],
    "responses": [
        "We comply with SEBI regulations, including disclosures under Regulation 46 of The SEBI (LODR) Regulations."
    ]
},
{
    "tag": "Media Coverage",
    "patterns": [
        "Details of Media Agreements",
        "Newspaper Publications under Reg. 47(1)",
        "Can you provide information about our media agreements?",
        "What are the newspaper publications under Reg. 47(1)?",
        "Tell me about the media coverage details.",
        "I'm interested in learning more about our media agreements and newspaper publications."
    ],
    "responses": [
        "Find details of our media agreements and newspaper publications under Reg. 47(1) for comprehensive media coverage."
    ]
},
{
    "tag": "Event Outcome",
    "patterns": [
        "Outcome of Board Meetings",
        "Change in Directors, KMP, Auditor and Compliance Officer",
        "AGM/EGM & Postal Ballot",
        "Other Disclosures",
        "What is the outcome of the latest board meeting?",
        "Can you provide information about changes in directors, KMP, auditor, and compliance officer?",
        "Tell me about the AGM/EGM & Postal Ballot results.",
        "What other disclosures should I be aware of?",
        "I'm interested in learning about recent event outcomes."
    ],
    "responses": [
        "Stay updated on the outcome of board meetings, changes in directors, KMPs, auditors, and compliance officers, as well as AGM/EGM & postal ballot results and other disclosures."
    ]
},
{
    "tag": "Grievance Redressal",
    "patterns": [
        "Email address for grievance redressal and other relevant details",
        "Contact information of the designated officials w.r.t. investor grievances",
        "How can I address grievances? Can I have the email?",
        "Who are the designated officials for investor grievances?",
        "I need to contact someone regarding investor grievances."
    ],
    "responses": [
        "For grievance redressal or any investor-related concerns, reach out to us via email or contact our designated officials."
    ]
},
{
    "tag": "Policy Details",
    "patterns": [
        "Vigil Mechanism/ Whistle Blower Policy",
        "Criteria of making payments to Non-Executive Directors",
        "Policy on dealing with related party transactions",
        "Policy for determining material subsidiaries",
        "Policy for determination of materiality of events under Reg. 30(4)",
        "Dividend Distribution Policy",
        "Can you provide details about the vigil mechanism/whistleblower policy?",
        "What are the criteria for making payments to Non-Executive Directors?",
        "Tell me about the policy regarding related party transactions.",
        "How is the policy determined for material subsidiaries?",
        "What is the policy for determining the materiality of events under Reg. 30(4)?",
        "What is the dividend distribution policy?"
    ],
    "responses": [
        "Learn about our policies, including the vigil mechanism/whistleblower policy, criteria for payments to non-executive directors, policies on related party transactions and material subsidiaries, and dividend distribution policy."
    ]
},
{
    "tag": "About Mr. Rohtas Goel",
    "patterns": [
        "Who is Mr. Rohtas Goel?",
        "Tell me about the director of Omaxe.",
        "What is Mr. Rohtas Goel's role in Omaxe?",
        "Can you provide information about the founder of Omaxe?",
        "I want to know more about the founder of Omaxe.",
        "What is the background of Mr. Rohtas Goel?",
        "Could you elaborate on Mr. Rohtas Goel's contribution to Omaxe?",
        "What are Mr. Rohtas Goel's qualifications?",
        "Is Mr. Rohtas Goel actively involved in Omaxe's operations?",
        "Can you share any significant achievements of Mr. Rohtas Goel?",
        "What motivated Mr. Rohtas Goel to establish Omaxe?",
        "How has Mr. Rohtas Goel shaped the vision of Omaxe?",
        "Tell me about Mr. Rohtas Goel's journey with Omaxe.",
        "Has Mr. Rohtas Goel received any notable awards or recognitions?",
        "What are Mr. Rohtas Goel's aspirations for Omaxe's future?",
        "Does Mr. Rohtas Goel participate in any philanthropic activities?",
        "What sets Mr. Rohtas Goel apart as a leader in the real estate industry?",
        "How does Mr. Rohtas Goel envision Omaxe's growth under his leadership?",
        "What values does Mr. Rohtas Goel prioritize in his leadership at Omaxe?",
        "Could you provide insights into Mr. Rohtas Goel's management style?",
        "What strategies has Mr. Rohtas Goel employed to steer Omaxe towards success?",
        "Can you describe Mr. Rohtas Goel's approach to innovation within Omaxe?",
        "What impact has Mr. Rohtas Goel had on the real estate landscape through Omaxe?",
        "How does Mr. Rohtas Goel inspire and motivate the team at Omaxe?",
        "What initiatives has Mr. Rohtas Goel spearheaded to enhance Omaxe's brand?"
    ],
    "responses": [
        "Mr. Rohtas Goel, Founding Chairman and Non-Executive Director of Omaxe Ltd., is a leading name in the real estate industry. He laid the foundation of Omaxe Ltd almost three decades ago and has since worked his way to the higher echelons of success and glory."
    ]
},
{
    "tag": "Additional Documents",
    "patterns": [
        "COI, MOA & AOA and Prospectus",
        "Notice of Board Meeting",
        "Financial Results",
        "Annual Reports",
        "Audited Financial Statements of Subsidiary Companies",
        "Annual Secretarial Compliance Report",
        "Where can I find the COI, MOA & AOA, and Prospectus?",
        "Can you provide information about the notice of board meetings?",
        "Where can I access the financial results?",
        "How can I obtain the annual reports?",
        "Are the audited financial statements of subsidiary companies available?",
        "How can I access the annual secretarial compliance report?",
        "I need access to additional documents. Can you help?"
    ],
    "responses": [
        "Access additional documents such as Certificate of Incorporation (COI), Memorandum of Association (MOA), Articles of Association (AOA), Prospectus, notice of board meetings, financial results, annual reports, audited financial statements of subsidiary companies, and annual secretarial compliance reports."
    ]
}
]