{
    "intents": [
      {
        "tag": "company_overview",
        "patterns": [
          "What does omaxe do?",
          "What kind of company is Omaxe?",
          "Tell me about Omaxe"
        ],
        "responses": [
          "Omaxe Limited is one of India's leading real estate development companies. Founded in 1987 by Rohtas Goel, Omaxe has established a strong presence in the real estate sector over the years. The company primarily focuses on residential, commercial, retail, and integrated townships developments across various cities in India."
        ]
      },
      {
        "tag": "Delhi_Mumbai_Expressway",
        "patterns": [
          "What is the Delhi-Mumbai Expressway?",
          "How long is the Delhi-Mumbai Expressway?",
          "Which cities does the Delhi-Mumbai Expressway connect?",
          "What is the purpose of the Delhi-Mumbai Expressway?",
          "Who is responsible for the construction of the Delhi-Mumbai Expressway?"
        ],
        "responses": [
          "The Delhi-Mumbai Expressway is a major highway in India connecting Delhi and Mumbai,aimed at improving connectivity and reducing travel time."
        ]
      },
      {
        "tag": "real_estate_investment",
        "patterns": [
          "What are the top five localities to invest in Delhi/NCR?",
          "How can I identify the right property to invest in during a real estate boom?",
          "What factors should I consider when investing in real estate?"
        ],
        "responses": [
          "Identifying the right property to invest in during a real estate boom is crucial. Some factors to consider include location, infrastructure development, market trends, and potential for future growth."
        ]
      },
      {
        "tag": "upcoming_luxury_mall",
        "patterns": [
          "What is the upcoming luxury mall in Delhi/NCR?",
          "Which luxury mall is being developed in Chandni Chowk?"
        ],
        "responses": [
          "The upcoming luxury mall in Delhi/NCR is Omaxe Chowk Mall, located in Chandni Chowk."
        ]
      },
      {
        "tag": "reasons_to_invest_in_delhi_realestate",
        "patterns": [
          "What are the reasons to invest in the growing real estate market of Delhi?",
          "Why is Delhi considered a prime residential market?"
        ],
        "responses": [
          "Delhi is alluded to be the ninth fastest-growing prime residential market among top global cities by the Prime Global Cities Index by property."
        ]
      },
      {
        "tag": "real_estate_investment_insights",
        "patterns": [
          "How can I find my dream property online during lockdown?",
          "What are some ways to buy real estate investment properties?"
        ],
        "responses": [
          "Finding your dream property online during lockdown can be done by utilizing online real estate platforms and virtual property tours."
        ]
      },
      {
        "tag": "property_returns_in_india",
        "patterns": [
          "Are there properties with guaranteed returns in India?",
          "What are the options for property investment with guaranteed returns?"
        ],
        "responses": [
          "Indians have an insatiable hunger for real estate. Property buying is seen as the safest and most fruitful form of investment."
        ]
      },
      {
        "tag": "residential_properties_in_new_chandigarh",
        "patterns": [
          "What are the residential properties available in New Chandigarh?",
          "What types of properties are offered in New Chandigarh?",
          "Can you list the residential properties in New Chandigarh?"
        ],
        "responses": [
          "There are several residential properties available in New Chandigarh including The Lake, Omaxe Plots, Celestia Royal Premier, Omaxe Silver Birch, Ambrosia, Omaxe Mulberry Villas, Celestia Royal, Celestia Grand, The Resort, Omaxe Cassia, and Gardenia."
        ]
      },
      {
        "tag": "residential_properties_in_ludhiana",
        "patterns": [
          "What are the residential properties available in Ludhiana?",
          "What types of properties are offered in Ludhiana?",
          "Can you list the residential properties in Ludhiana?"
        ],
        "responses": [
          "There are several residential properties available in Ludhiana including Celestia Grand Premier, The Royal Meridian, Rose Villa, Celestia Grand, Royal View Homes, Omaxe Royal View Executive, Omaxe Royal Residency, Royal View Premier, Twin Tower, and Royal Signature."
        ]
      },
      {
        "tag": "residential_properties_in_lucknow",
        "patterns": [
          "What are the residential properties available in Lucknow?",
          "What types of properties are offered in Lucknow?",
          "Can you list the residential properties in Lucknow?"
        ],
        "responses": [
          "There are several residential properties available in Lucknow including The Legends, The Resort, Omaxe Residency II, The Palace, Omaxe Heights, Omaxe Residency, Omaxe Waterscapes, Omaxe City Lucknow, Grand Omaxe, and Hazratganj Residency."
        ]
      },
      {
        "tag": "residential_properties_in_faridabad",
        "patterns": [
          "What are the residential properties available in Faridabad?",
          "What types of properties are offered in Faridabad?",
          "Can you list the residential properties in Faridabad?"
        ],
        "responses": [
          "There are several residential properties available in Faridabad including The Forest Spa, Omaxe Hills II, Omaxe Hills, Omaxe Heights 4BHK, Omaxe New Heights, Royal Residency, Omaxe Heights 2 & 3 BHK, Omaxe Spa Village, and Omaxe City."
        ]
      },
      {
        "tag": "residential_properties_in_bahadurgarh",
        "patterns": [
          "What are the residential properties available in Bahadurgarh?",
          "What types of properties are offered in Bahadurgarh?",
          "Can you list the residential properties in Bahadurgarh?"
        ],
        "responses": [
          "There are several residential properties available in Bahadurgarh including Omaxe North Avenue II, Omaxe Royal Street, Omaxe Shubhangan, Omaxe North Avenue, and Omaxe City Homes."
        ]
      },
      {
        "tag": "residential_properties_in_vrindavan",
        "patterns": [
          "What are the residential properties available in Vrindavan?",
          "What types of properties are offered in Vrindavan?",
          "Can you list the residential properties in Vrindavan?"
        ],
        "responses": [
          "There are several residential properties available in Vrindavan including Krishna Crest (Service Apartments), Omaxe Full Moon (1BHK+Study, 2BHK+Study & 3BHK), Omaxe Eternity (2 BHK, & Studio Apartments), and Krishna Castle (Studio Apartments, 1- Bed Room)."
        ]
      },
      {
        "tag": "residential_properties_in_gurugram",
        "patterns": [
          "What are the residential properties available in Gurugram?",
          "What types of properties are offered in Gurugram?",
          "Can you list the residential properties in Gurugram?"
        ],
        "responses": [
          "There are several residential properties available in Gurugram including Mayfield Garden Designer Villas (Villas, Independent floor), Omaxe Olive Apartments I & II (3 BHK Apartments), Suncity Executive Floors (Independent Floors), South Avenue Executive Floors (3 BHK Flats & Luxury Apartments), Sushant Lok II Executive Floors (Independent 3BHK Floors), and Omaxe The Nile (Multistorey Apartments - 3BHK,4BHK Appartments)."
        ]
      },
      {
        "tag": "residential_properties_in_noida",
        "patterns": [
          "What are the residential properties available in Noida?",
          "What types of properties are offered in Noida?",
          "Can you list the residential properties in Noida?"
        ],
        "responses": [
          "There are several residential properties available in Noida including Omaxe Royal Residency (3/4 BHK Apartments), Omaxe Twin Towers (3/4BHK Apartments), Grand Omaxe (2BHK, 3BHK & 3BHK+SR), The Forest Spa (3/4BHK Apartments), and The Forest (4-BHK, 5-BHK & Penthouses)."
        ]
      },
      {
        "tag": "residential_properties_in_greater_noida",
        "patterns": [
          "What are the residential properties available in Greater Noida?",
          "What types of properties are offered in Greater Noida?",
          "Can you list the residential properties in Greater Noida?"
        ],
        "responses": [
          "There are several residential properties available in Greater Noida including Omaxe Palm Greens (2BHK, 3BHK, 3BHK+servant room, 4BHK+servant room), Orchid Avenue (2BHK & 3BHK Apartments), and Omaxe Palm Villas (2BHK, 3BHK, 3BHK+SR & 4BHK+SR)."
        ]
      },
      {
        "tag": "residential_properties_in_prayagraj",
        "patterns": [
          "What are the residential properties available in Prayagraj?",
          "What types of properties are offered in Prayagraj?",
          "Can you list the residential properties in Prayagraj?"
        ],
        "responses": [
          "There are several residential properties available in Prayagraj including OmaxShiva (G+3 Storey, 3 BHK Premium Floors with a Store on Terrace), OmaxShiva Phase II (G+3 Storey, 3 BHK Premium Floors with a Store on Terrace), OmaxShiva Phase III (G+3 Storey, 3 BHK Premium Floors with a Store on Terrace), and Omaxe Aananda (2BHK, 2 BHK + STUDY & 3 BHK Apartments)."
        ]
      },
      {
        "tag": "residential_properties_in_derabassi",
        "patterns": [
          "What are the residential properties available in Derabassi?",
          "What types of properties are offered in Derabassi?",
          "Can you list the residential properties in Derabassi?"
        ],
        "responses": [
          "There are several residential properties available in Derabassi including Omaxe Greens 2 (G+4, S+4, Villa Independent Floors) and Omaxe Greens (2 BHK & 3 BHK Flats)."
        ]
      },
      {
        "tag": "residential_properties_in_indore",
        "patterns": [
          "What are the residential properties available in Indore?",
          "What types of properties are offered in Indore?",
          "Can you list the residential properties in Indore?"
        ],
        "responses": [
          "There are several residential properties available in Indore including Omaxe City Annex Villas (4BHK Apartment Villa), Omaxe City G+2 (3BHK Apartments), Omaxe City Villas (3BHK Apartments), Omaxe Hills (Developed Plots), Omaxe Greens (Plots), Omaxe High Street Apartment (Commercial Space, Apartments & Shops), Omaxe City Mangliya Court (2BHK Villa), Omaxe City Plots (Developed Plots), Omaxe City Annex Plots (Plots), Omaxe City Annex Happy Homes (4BHK Apartment), Omaxe City Mayakhedi Extn (Plots), Omaxe Dream Homes (Plots), Shubhangan Villa (3 BHK Villa Independent floor), Omaxe Plots Mayakhedi (Developed Plots), Omaxe Shubhangan (Developed Plots), and Omaxe Anandam (Plot)."
        ]
      },
      {
        "tag": "residential_properties_in_patiala",
        "patterns": [
          "What are the residential properties available in Patiala?",
          "What types of properties are offered in Patiala?",
          "Can you list the residential properties in Patiala?"
        ],
        "responses": [
          "There are several residential properties available in Patiala including PDA Omaxe City (Developed Plots)."
        ]
      },
      {
        "tag": "residential_properties_in_sonepat",
        "patterns": [
          "What are the residential properties available in Sonepat?",
          "What types of properties are offered in Sonepat?",
          "Can you list the residential properties in Sonepat?"
        ],
        "responses": [
          "There are several residential properties available in Sonepat including Omaxe Wisteria (Independent Floors), Omaxe City - Omaxe Heights (2BHK Apartments), Omaxe City - Swarnaprastha (3BHK Independent Floors), and Omaxe City - Villas (2BHK, 3BHK & 4BHK Villas)."
        ]
      },
      {
        "tag": "residential_properties_in_yamuna_nagar",
        "patterns": [
          "What are the residential properties available in Yamuna Nagar?",
          "What types of properties are offered in Yamuna Nagar?",
          "Can you list the residential properties in Yamuna Nagar?"
        ],
        "responses": [
          "There are several residential properties available in Yamuna Nagar including Omaxe City- Plots (Developed Plots) and Omaxe City - Villa (Villa Independent floor)."
        ]
      },
      {
        "tag": "residential_properties_in_rudrapur",
        "patterns": [
          "What are the residential properties available in Rudrapur?",
          "What types of properties are offered in Rudrapur?",
          "Can you list the residential properties in Rudrapur?"
        ],
        "responses": [
          "There are several residential properties available in Rudrapur including Omaxe Riviera Greenland Villas (2BHK, 3BHK Apartments & Duplex Villa), Omaxe Riviera Group Housing (1/2/3/4 BHK Apartments), and Omaxe Riviera Thames (4-BHK, 4-BHK + SR)."
        ]
      },
      {
        "tag": "residential_properties_in_bathinda",
        "patterns": [
          "What are the residential properties available in Bathinda?",
          "What types of properties are offered in Bathinda?",
          "Can you list the residential properties in Bathinda?"
        ],
        "responses": [
          "There are several residential properties available in Bathinda including Omaxe City - Villas (2BHK, 3BHK, 4BHK Flats) and Omaxe City - Plots (Developed Plots)."
        ]
      },
      {
        "tag": "residential_properties_in_baddi",
        "patterns": [
          "What are the residential properties available in Baddi?",
          "What types of properties are offered in Baddi?",
          "Can you list the residential properties in Baddi?"
        ],
        "responses": [
          "There are several residential properties available in Baddi including Omaxe Park Woods (1BHK, 2BHK, 3BHK Apartments) and Omaxe Park Woods - Plots (Plots)."
        ]
      },
      {
        "tag": "residential_properties_in_bhiwadi",
        "patterns": [
          "What are the residential properties available in Bhiwadi?",
          "What types of properties are offered in Bhiwadi?",
          "Can you list the residential properties in Bhiwadi?"
        ],
        "responses": [
          "There are several residential properties available in Bhiwadi including Panorama City Mid Town (1BHK, Apartments & Studio Apartment), Omaxe Marigold (1BHK & 2BHK Apartments), Omaxe Sunrise (Plots), Omaxe Panorama City Plots (Developed Plots), Omaxe Europia (2BHK & Studio Apartments), Omaxe Panorama City Villas (2BHK, 3BHK Apartments & 3BHK Duplex Apartments), and Omaxe Green Meadow City (Plots, G+2 Floors, Independent duplex Villas)."
        ]
      },
      {
        "tag": "residential_properties_in_indirapuram",
        "patterns": [
          "What are the residential properties available in Indirapuram?",
          "What types of properties are offered in Indirapuram?",
          "Can you list the residential properties in Indirapuram?"
        ],
        "responses": [
          "There are several residential properties available in Indirapuram including Omaxe Habitat Floors (Low Rise Apartments)."
        ]
      },
      {
        "tag": "residential_properties_in_jaipur",
        "patterns": [
          "What are the residential properties available in Jaipur?",
          "What types of properties are offered in Jaipur?",
          "Can you list the residential properties in Jaipur?"
        ],
        "responses": [
          "There are several residential properties available in Jaipur including Omaxe Executive Homez (2/3 BHK Apartments), Omaxe City Shubhangan (1BHK & 2BHK Apartments), Omaxe City - Plots & Villas (2/3 BHK Apartments), and Omaxe City - The Prime (Developed Plots)."
        ]
      },
      {
        "tag": "residential_properties_in_rohtak",
        "patterns": [
          "What are the residential properties available in Rohtak?",
          "What types of properties are offered in Rohtak?",
          "Can you list the residential properties in Rohtak?"
        ],
        "responses": [
          "There are several residential properties available in Rohtak including Rohtak Plots (Developed Plots), Omaxe Rohtak Villas (3BHK Apartments), Omaxe Green Valley (Plots/Commercial shops), and Omaxe Happy Homes (3BHK Apartments)."
        ]
      },
      {
        "tag": "residential_properties_in_palwal",
        "patterns": [
          "What are the residential properties available in Palwal?",
          "What types of properties are offered in Palwal?",
          "Can you list the residential properties in Palwal?"
        ],
        "responses": [
          "There are several residential properties available in Palwal including Omaxe City Happy Homes Palwal (2/3/4 BHK Aparments), Omaxe City Omaxe Heights Palwal (2/3 BHK Apartments), Omaxe City Villas (2 BHK Villa), and Omaxe City Plots (Developed Plots)."
        ]
      },
      {
        "tag": "commercial_properties_in_new_delhi",
        "patterns": [
          "What are the commercial properties available in New Delhi?",
          "What types of properties are offered in New Delhi?",
          "Can you list the commercial properties in New Delhi?"
        ],
        "responses": [
          "There are several commercial properties available in New Delhi including Pearls Omaxe (Commercial Space), Omaxe Square (Commercial Space), and Omaxe Chowk (Wholesale, Retail & Food Court)."
        ]
      },
      {
        "tag": "commercial_properties_in_new_chandigarh",
        "patterns": [
          "What are the commercial properties available in New Chandigarh?",
          "What types of properties are offered in New Chandigarh?",
          "Can you list the commercial properties in New Chandigarh?"
        ],
        "responses": [
          "There are several commercial properties available in New Chandigarh including Beacon Street (Multiplex, Serviced Suites, Shops, Food Court, Club & Virtual Gaming Zone), Clockton High Street (Shopping Complex & Office Spaces), India Trade Tower (Commercial Complex & Office Spaces), International Trade Tower (Commercial Complex), and Holiday Inn (Hotel Suites, Office Space)."
        ]
      },
      {
        "tag": "commercial_properties_in_ludhiana",
        "patterns": [
          "What are the commercial properties available in Ludhiana?",
          "What types of properties are offered in Ludhiana?",
          "Can you list the commercial properties in Ludhiana?"
        ],
        "responses": [
          "There are several commercial properties available in Ludhiana including Royal Street Sector Satara (Booth, Shop, SCOs & Service Studio), Omaxe Plaza (Multiplex & Shops), and Omaxe Royal Arcade (Shops & Multiplex)."
        ]
      },
      {
        "tag": "commercial_properties_in_lucknow",
        "patterns": [
          "What are the commercial properties available in Lucknow?",
          "What types of properties are offered in Lucknow?",
          "Can you list the commercial properties in Lucknow?"
        ],
        "responses": [
          "There are several commercial properties available in Lucknow including Omaxe Hi Street (Hotel Suites), Omaxe Hazratganj Phase II (Shops & Service Apartments, Offices), and Omaxe Hazratganj (Shops & Service Apartments, Offices)."
        ]
      },
      {
        "tag": "commercial_properties_in_faridabad",
        "patterns": [
          "What are the commercial properties available in Faridabad?",
          "What types of properties are offered in Faridabad?",
          "Can you list the commercial properties in Faridabad?"
        ],
        "responses": [
          "There are several commercial properties available in Faridabad including Omaxe Hi Fun (10 screen multiplex, Gaming Zone, Food court, Showroom kiosk & Hypermarket), Royal Street (Retail Shops), World Street (Mixed Use Land), and Omaxsun (Office Space)."
        ]
      },
      {
        "tag": "commercial_properties_in_bahadurgarh",
        "patterns": [
          "What are the commercial properties available in Bahadurgarh?",
          "What types of properties are offered in Bahadurgarh?",
          "Can you list the commercial properties in Bahadurgarh?"
        ],
        "responses": [
          "There are several commercial properties available in Bahadurgarh including Omaxe Galleria (Retails Shops, Ofiice Spaces & Service Flats) and Omaxe City Gate (Shops, Offices & Service Apartments)."
        ]
      },
      {
        "tag": "commercial_properties_in_gurugram",
        "patterns": [
          "What are the commercial properties available in Gurugram?",
          "What types of properties are offered in Gurugram?",
          "Can you list the commercial properties in Gurugram?"
        ],
        "responses": [
          "There are several commercial properties available in Gurugram including Omaxe Celebrations Mall (Multiplex, Retail & Food Court), Omaxe Gurgaon Mall (Multiplex, Retail Shops & Food Court), and Omaxe City Centre (Commercial Space)."
        ]
      },
      {
        "tag": "commercial_properties_in_greater_noida",
        "patterns": [
          "What are the commercial properties available in Greater Noida?",
          "What types of properties are offered in Greater Noida?",
          "Can you list the commercial properties in Greater Noida?"
        ],
        "responses": [
          "There are several commercial properties available in Greater Noida including India Trade Center (Retail, Office & Serviced Apartments), Omaxe Palm Court (Commercial Space), Omaxe Arcade (Commercial Complex), NRI City Center (Multiplex, Retail Shops, Food Court & Fun Zone), and Omaxe Connaught Place (Multiplex, Retail Shops, Office Space, Food Court, Fun Zone & Theme Park)."
        ]
      },
      {
        "tag": "commercial_properties_in_patiala",
        "patterns": [
          "What are the commercial properties available in Patiala?",
          "What types of properties are offered in Patiala?",
          "Can you list the commercial properties in Patiala?"
        ],
        "responses": [
          "There are commercial properties available in Patiala including Omaxe Mall (Multiplex, Retail & Food Court)."
        ]
      },
      {
        "tag": "commercial_properties_in_amritsar",
        "patterns": [
          "What are the commercial properties available in Amritsar?",
          "What types of properties are offered in Amritsar?",
          "Can you list the commercial properties in Amritsar?"
        ],
        "responses": [
          "There are commercial properties available in Amritsar including Omaxe Value Mall (Multiplex, Retail Shops & Food Court) and Omaxe Novelty Mall (Shopping Complex)."
        ]
      },
      {
        "tag": "commercial_properties_in_sonepat",
        "patterns": [
          "What are the commercial properties available in Sonepat?",
          "What types of properties are offered in Sonepat?",
          "Can you list the commercial properties in Sonepat?"
        ],
        "responses": [
          "There are commercial properties available in Sonepat including Omaxe City- Omaxe Plaza (Shops , Offices & Food Court)."
        ]
      },
      {
        "tag": "commercial_properties_in_agra",
        "patterns": [
          "What are the commercial properties available in Agra?",
          "What types of properties are offered in Agra?",
          "Can you list the commercial properties in Agra?"
        ],
        "responses": [
          "There are commercial properties available in Agra including Omaxe SRK Mall (Multiplex, Retail & Food Court)."
        ]
      },
      {
        "tag": "commercial_properties_in_indirapuram",
        "patterns": [
          "What are the commercial properties available in Indirapuram?",
          "What types of properties are offered in Indirapuram?",
          "Can you list the commercial properties in Indirapuram?"
        ],
        "responses": [
          "There are commercial properties available in Indirapuram including Omaxe Plaza Indirapuram (Mall)."
        ]
      },
      {
        "tag": "commercial_properties_in_jaipur",
        "patterns": [
          "What are the commercial properties available in Jaipur?",
          "What types of properties are offered in Jaipur?",
          "Can you list the commercial properties in Jaipur?"
        ],
        "responses": [
          "There are commercial properties available in Jaipur including Omaxe Central Market RC-7 (Shops), Omaxe Shubhangan Street Market (Shopping Complex), and Omaxe City Street Market (Retail Shops)."
        ]
      },
      {
        "tag": "commercial_properties_in_sonepat",
        "patterns": [
          "What are the commercial properties available in Sonepat?",
          "What types of properties are offered in Sonepat?",
          "Can you list the commercial properties in Sonepat?"
        ],
        "responses": [
          "There are commercial properties available in Sonepat including Omaxe City- Omaxe Plaza (Shops , Offices & Food Court)."
        ]
      },
      {
        "tag": "commercial_properties_in_agra",
        "patterns": [
          "What are the commercial properties available in Agra?",
          "What types of properties are offered in Agra?",
          "Can you list the commercial properties in Agra?"
        ],
        "responses": [
          "There are commercial properties available in Agra including Omaxe SRK Mall (Multiplex, Retail & Food Court)."
        ]
      },
      {
        "tag": "commercial_properties_in_indirapuram",
        "patterns": [
          "What are the commercial properties available in Indirapuram?",
          "What types of properties are offered in Indirapuram?",
          "Can you list the commercial properties in Indirapuram?"
        ],
        "responses": [
          "There are commercial properties available in Indirapuram including Omaxe Plaza Indirapuram (Mall)."
        ]
      },
      {
        "tag": "commercial_properties_in_jaipur",
        "patterns": [
          "What are the commercial properties available in Jaipur?",
          "What types of properties are offered in Jaipur?",
          "Can you list the commercial properties in Jaipur?"
        ],
        "responses": [
          "There are commercial properties available in Jaipur including Omaxe Central Market RC-7 (Shops), Omaxe Shubhangan Street Market (Shopping Complex), and Omaxe City Street Market (Retail Shops)."
        ]
      },
      {
        "tag": "residential_properties_in_new_chandigarh",
        "patterns": [
          "What are the residential properties available in New Chandigarh?",
          "Can you list the residential properties in New Chandigarh?",
          "Tell me about the residential properties in New Chandigarh."
        ],
        "responses": [
          "There are residential properties available in New Chandigarh including:\n- The Lake: 1/2/3/4 BHK Apartments & Penthouses\n- Omaxe Plots: Developed Plots\n- Celestia Royal Premier: Stilt + 4, 3BHK Independent Floors\n- Omaxe Silver Birch: 3BHK, 4BHK, G+2 Independent Floor\n- Ambrosia: S+3 3BHK Independent Floor\n- Omaxe Mulberry Villas: G+1 Duplex\n- Celestia Royal: S+3 3/4 BHK Apartments\n- Celestia Grand: 3BHK Apartments\n- The Resort: 2BHK, 2BHK + Utility, 3BHK, Penthouses\n- Omaxe Cassia: 3BHK+SR, 4BHK+SR Apartments\n- Gardenia: 3 BHK, 3 BHK + Servant, 3 BHK + Servant + Store, Penthouse"
        ]
      },
      {
        "tag": "residential_properties_in_ludhiana",
        "patterns": [
          "What are the residential properties available in Ludhiana?",
          "Can you list the residential properties in Ludhiana?",
          "Tell me about the residential properties in Ludhiana."
        ],
        "responses": [
          "There are residential properties available in Ludhiana including:\n- Celestia Grand Premier: G+4 (Independent Floors)\n- The Royal Meridian: 3BHK + SR +  Powder Room, 4BHK + SR + Powder Room Apartments & Penthouses\n- Rose Villa: 3/4 BHK Villa\n- Celestia Grand: 3BHK + Servant Room Apartment\n- Royal View Homes: 3BHK + Servant Room Apartments\n- Omaxe Royal View Executive: 3BHK + Servant Room + Store Room Apartment\n- Omaxe Royal Residency: 2/3 BHK, 3BHK + Utility, 3BHK + Servant Room, 4BHK + Servant Room Apartments & Penthouses\n- Royal View Premier: 3 BHK + Servant Room Independent Floors\n- Twin Tower: 1/2/3 BHK Apartments\n- Royal Signature: PENTHOUSE | 5 BHK | 5 BHK + AV ROOM"
        ]
      },
      {
        "tag": "residential_properties_in_lucknow",
        "patterns": [
          "What are the residential properties available in Lucknow?",
          "Can you list the residential properties in Lucknow?",
          "Tell me about the residential properties in Lucknow."
        ],
        "responses": [
          "There are residential properties available in Lucknow including:\n- The Legends: 4 BHK + Additional Space for Work from Home (Available with 2nd to 21st Floor units) + 2 Stores + Servant Room\n- The Resort: 3/4 BHK (with servant) + Penthouse\n- Omaxe Residency II: 2BHK, 3BHK, 3BHK + Servant Room Apartments\n- The Palace: 3BHK Apartment\n- Omaxe Heights: 3BHK, 3BHK + Servant Room Apartments & 4BHK Penthouses\n- Omaxe Residency: 2BHK & 3BHK Apartments\n- Omaxe Waterscapes: 3 BHK, 3 BHK+Servant\n- Omaxe City Lucknow: Plots and Villas\n- Grand Omaxe: 1BHK, 2BHK, 2BHK  + Study Room, 3BHK Apartments & Penthouses\n- Hazratganj Residency: 1BHK + Store, 2BHK + Store, 3BHK + Store Apartments & Penthouses\n- Celestia Gold (Independent Floors): 2 BHK + Store/ Barsati & Stilt + 3 Storeys with Lift\n- Celestia Grande (Independent Floors): 3 BHK + Store/ Barsati & Stilt + 3 Storeys with Lift\n- Celestia Royale (Independent Floors): 4 BHK + Store/ Barsati & Stilt + 3 Storeys with Lift\n- Kingston: 4BHK Luxurious Apartments\n- Europia Villa: 4 BHK + Family Lounge + Store"
        ]
      },
      {
        "tag": "residential_properties_in_faridabad",
        "patterns": [
          "What are the residential properties available in Faridabad?",
          "Can you list the residential properties in Faridabad?",
          "Tell me about the residential properties in Faridabad."
        ],
        "responses": [
          "There are residential properties available in Faridabad including:\n- The Forest Spa: 4BHK + Servent Room Apartment & Penthouses\n- Omaxe Hills II: 3BHK Apartments\n- Omaxe Hills: 2BHK & 3BHK + Servent Room Apartments\n- Omaxe Heights 4BHK: 4BHK + Servent Room Apartment & Penthouses\n- Omaxe New Heights: 2BHK & 3BHK Apartments\n- Royal Residency: 3BHK Apartments\n- Omaxe Heights 2 & 3 BHK: 2/3 BHK Apartments\n- Omaxe Spa Village: 3BHK, 3BHK+SR, 4BHK+SR & Penthouses\n- Omaxe City: Plot"
        ]
      },
      {
        "tag": "residential_properties_in_bahadurgarh",
        "patterns": [
          "What are the residential properties available in Bahadurgarh?",
          "Can you list the residential properties in Bahadurgarh?",
          "Tell me about the residential properties in Bahadurgarh."
        ],
        "responses": [
          "There are residential properties available in Bahadurgarh including:\n- Omaxe North Avenue II: 3BHK & 3BHK + Servent Room Apartments\n- Omaxe Royal Street: 3BHK Apartments\n- Omaxe Shubhangan: 1BHK, 2BHK, 3BHK & 4BHK Apartments\n- Omaxe North Avenue: 2BHK Apartment\n- Omaxe City Homes: 3BHK Apartments"
        ]
      },
      {
        "tag": "residential_properties_in_vrindavan",
        "patterns": [
          "What are the residential properties available in Vrindavan?",
          "Can you list the residential properties in Vrindavan?",
          "Tell me about the residential properties in Vrindavan."
        ],
        "responses": [
          "There are residential properties available in Vrindavan including:\n- Krishna Crest: Service Apartments\n- Omaxe Full Moon: 1BHK+Study, 2BHK+Study & 3BHK\n- Omaxe Eternity: 2 BHK, & Studio Apartments\n- Krishna Castle: Studio Apartments, 1- Bed Room"
        ]
      },
      {
        "tag": "residential_properties_in_gurugram",
        "patterns": [
          "What are the residential properties available in Gurugram?",
          "Can you list the residential properties in Gurugram?",
          "Tell me about the residential properties in Gurugram."
        ],
        "responses": [
          "There are residential properties available in Gurugram including:\n- Mayfield Garden Designer Villas: Villas, Independent floor\n- Omaxe Olive Apartments I & II: 3 BHK Apartments\n- Suncity Executive Floors: Independent Floors\n- South Avenue Executive Floors: 3 BHK Flats & Luxury Apartments\n- Sushant Lok II Executive Floors: Independent 3BHK Floors\n- Omaxe The Nile: Multistorey Apartments - 3BHK,4BHK Appartments"
        ]
      },
      {
        "tag": "residential_properties_in_noida",
        "patterns": [
          "What are the residential properties available in Noida?",
          "Can you list the residential properties in Noida?",
          "Tell me about the residential properties in Noida."
        ],
        "responses": [
          "There are residential properties available in Noida including:\n- Omaxe Royal Residency: 3/4 BHK Apartments\n- Omaxe Twin Towers: 3/4BHK Apartments\n- Grand Omaxe: 2BHK, 3BHK & 3BHK+SR\n- The Forest Spa: 3/4BHK Apartments\n- The Forest: 4-BHK, 5-BHK & Penthouses"
        ]
      },
      {
        "tag": "residential_properties_in_greater_noida",
        "patterns": [
          "What are the residential properties available in Greater Noida?",
          "Can you list the residential properties in Greater Noida?",
          "Tell me about the residential properties in Greater Noida."
        ],
        "responses": [
          "There are residential properties available in Greater Noida including:\n- Omaxe Palm Greens: 2BHK, 3BHK, 3BHK+servant room, 4BHK+servant room\n- Orchid Avenue: 2BHK & 3BHK Apartments\n- Omaxe Palm Villas: 2BHK, 3BHK, 3BHK+SR & 4BHK+SR"
        ]
      },
      {
        "tag": "residential_properties_in_prayagraj",
        "patterns": [
          "What are the residential properties available in Prayagraj?",
          "Can you list the residential properties in Prayagraj?",
          "Tell me about the residential properties in Prayagraj."
        ],
        "responses": [
          "There are residential properties available in Prayagraj including:\n- OmaxShiva: G+3 Storey, 3 BHK Premium Floors with a Store on Terrace\n- OmaxShiva Phase II: G+3 Storey, 3 BHK Premium Floors with a Store on Terrace\n- OmaxShiva Phase III: G+3 Storey, 3 BHK Premium Floors with a Store on Terrace\n- Omaxe Aananda: 2BHK, 2 BHK + STUDY & 3 BHK Apartments"
        ]
      },
      {
        "tag": "residential_properties_in_derabassi",
        "patterns": [
          "What are the residential properties available in Derabassi?",
          "Can you list the residential properties in Derabassi?",
          "Tell me about the residential properties in Derabassi."
        ],
        "responses": [
          "There are residential properties available in Derabassi including:\n- Omaxe Greens 2: G+4, S+4, Villa Independent Floors\n- Omaxe Greens: 2 BHK & 3 BHK Flats"
        ]
      },
      {
        "tag": "residential_properties_in_indore",
        "patterns": [
          "What are the residential properties available in Indore?",
          "Can you list the residential properties in Indore?",
          "Tell me about the residential properties in Indore."
        ],
        "responses": [
          "There are residential properties available in Indore including:\n- Omaxe City Annex Villas: 4BHK Apartment Villa\n- Omaxe City G+2: 3BHK Apartments\n- Omaxe City Villas: 3BHK Apartments\n- Omaxe Hills: Developed Plots\n- Omaxe Greens: Plots\n- Omaxe High Street Apartment: Commercial Space, Apartments & Shops\n- Omaxe City Mangliya Court: 2BHK Villa\n- Omaxe City Plots: Developed Plots\n- Omaxe City Annex Plots: Plots\n- Omaxe City Annex Happy Homes: 4BHK Apartment\n- Omaxe City Mayakhedi Extn: Plots\n- Omaxe Dream Homes: Plots\n- Shubhangan Villa: 3 BHK Villa Independent floor\n- Omaxe Plots Mayakhedi: Developed Plots\n- Omaxe Shubhangan: Developed Plots\n- Omaxe Anandam: Plot"
        ]
      },
      {
        "tag": "residential_properties_in_patiala",
        "patterns": [
          "What are the residential properties available in Patiala?",
          "Can you list the residential properties in Patiala?",
          "Tell me about the residential properties in Patiala."
        ],
        "responses": [
          "There are residential properties available in Patiala including:\n- PDA Omaxe City: Developed Plots"
        ]
      },
      {
        "tag": "residential_properties_in_sonepat",
        "patterns": [
          "What are the residential properties available in Sonepat?",
          "Can you list the residential properties in Sonepat?",
          "Tell me about the residential properties in Sonepat."
        ],
        "responses": [
          "There are residential properties available in Sonepat including:\n- Omaxe Wisteria: Independent Floors\n- Omaxe City - Omaxe Heights: 2BHK Apartments\n- Omaxe City - Swarnaprastha: 3BHK Independent Floors\n- Omaxe City - Villas: 2BHK, 3BHK & 4BHK Villas"
        ]
      },
      {
        "tag": "residential_properties_in_yamuna_nagar",
        "patterns": [
          "What are the residential properties available in Yamuna Nagar?",
          "Can you list the residential properties in Yamuna Nagar?",
          "Tell me about the residential properties in Yamuna Nagar."
        ],
        "responses": [
          "There are residential properties available in Yamuna Nagar including:\n- Omaxe City- Plots: Developed Plots\n- Omaxe City - Villa: Villa Independent floor"
        ]
      },
      {
        "tag": "residential_properties_in_rudrapur",
        "patterns": [
          "What are the residential properties available in Rudrapur?",
          "Can you list the residential properties in Rudrapur?",
          "Tell me about the residential properties in Rudrapur."
        ],
        "responses": [
          "There are residential properties available in Rudrapur including: Omaxe Riviera Greenland Villas: 2BHK, 3BHK Apartments & Duplex Villa\n- Omaxe Riviera Group Housing: 1/2/3/4 BHK Apartments\n- Omaxe Riviera Thames: 4-BHK, 4-BHK + SR"
        ]
      },
      {
        "tag": "residential_properties_in_bathinda",
        "patterns": [
          "What are the residential properties available in Bathinda?",
          "Can you list the residential properties in Bathinda?",
          "Tell me about the residential properties in Bathinda."
        ],
        "responses": [
          "There are residential properties available in Bathinda including: Omaxe City - Villas: 2BHK, 3BHK, 4BHK Flats\n- Omaxe City - Plots: Developed Plots"
        ]
      },
      {
        "tag": "residential_properties_in_baddi",
        "patterns": [
          "What are the residential properties available in Baddi?",
          "Can you list the residential properties in Baddi?",
          "Tell me about the residential properties in Baddi."
        ],
        "responses": [
          "There are residential properties available in Baddi including:- Omaxe Park Woods: 1BHK, 2BHK, 3BHK Apartments\n- Omaxe Park Woods - Plots: Plots"
        ]
      },
      {
        "tag": "residential_properties_in_bhiwadi",
        "patterns": [
          "What are the residential properties available in Bhiwadi?",
          "Can you list the residential properties in Bhiwadi?",
          "Tell me about the residential properties in Bhiwadi."
        ],
        "responses": [
          "There are residential properties available in Bhiwadi including: Panorama City Mid Town: 1BHK, Apartments & Studio Apartment\n- Omaxe Marigold: 1BHK & 2BHK Apartments\n- Omaxe Sunrise: Plots\n- Omaxe Panorama City Plots: Developed Plots\n- Omaxe Europia: 2BHK & Studio Apartments\n- Omaxe Panorama City Villas: 2BHK, 3BHK Apartments & 3BHK Duplex Apartments\n- Omaxe Green Meadow City: Plots, G+2 Floors, Independent duplex Villas"
        ]
      },
      {
        "tag": "residential_properties_in_indirapuram",
        "patterns": [
          "What are the residential properties available in Indirapuram?",
          "Can you list the residential properties in Indirapuram?",
          "Tell me about the residential properties in Indirapuram."
        ],
        "responses": [
          "There are residential properties available in Indirapuram including: Omaxe Habitat Floors: Low Rise Apartments"
        ]
      },
      {
        "tag": "residential_properties_in_jaipur",
        "patterns": [
          "What are the residential properties available in Jaipur?",
          "Can you list the residential properties in Jaipur?",
          "Tell me about the residential properties in Jaipur."
        ],
        "responses": [
          "There are residential properties available in Jaipur including: Omaxe Executive Homez: 2/3 BHK Apartments\n- Omaxe City Shubhangan: 1BHK & 2BHK Apartments\n- Omaxe City - Plots & Villas: 2/3 BHK Apartments\n- Omaxe City - The Prime: Developed Plots"
        ]
      },
      {
        "tag": "residential_properties_in_rohtak",
        "patterns": [
          "What are the residential properties available in Rohtak?",
          "Can you list the residential properties in Rohtak?",
          "Tell me about the residential properties in Rohtak."
        ],
        "responses": [
          "There are residential properties available in Rohtak including:\n- Rohtak Plots: Developed Plots, Omaxe Rohtak Villas: 3BHK Apartments\n- Omaxe Green Valley: Plots/Commercial shops\n- Omaxe Happy Homes: 3BHK Apartments"
        ]
      },
      {
        "tag": "residential_properties_in_palwal",
        "patterns": [
          "What are the residential properties available in Palwal?",
          "Can you list the residential properties in Palwal?",
          "Tell me about the residential properties in Palwal."
        ],
        "responses": [
          "There are residential properties available in Palwal including:\n- Omaxe City Happy Homes Palwal: 2/3/4 BHK Aparments\n- Omaxe City Omaxe Heights Palwal: 2/3 BHK Apartments\n- Omaxe City Villas: 2 BHK Villa\n- Omaxe City Plots: Developed Plots"
        ]
      },
      {
        "tag": "commercial_properties_in_new_delhi",
        "patterns": [
          "What are the commercial properties available in New Delhi?",
          "Can you list the commercial properties in New Delhi?",
          "Tell me about the commercial properties in New Delhi."
        ],
        "responses": [
          "There are commercial properties available in New Delhi including:\n- Pearls Omaxe: Commercial Space\n- Omaxe Square: Commercial Space\n- Omaxe Chowk: Wholesale, Retail & Food Court"
        ]
      },
      {
        "tag": "commercial_properties_in_new_chandigarh",
        "patterns": [
          "What are the commercial properties available in New Chandigarh?",
          "Can you list the commercial properties in New Chandigarh?",
          "Tell me about the commercial properties in New Chandigarh."
        ],
        "responses": [
          "There are commercial properties available in New Chandigarh including:\n- Beacon Street: Multiplex, Serviced Suites, Shops, Food Court, Club & Virtual Gaming Zone\n- Clockton High Street: Shopping Complex & Office Spaces\n- India Trade Tower: Commercial Complex & Office Spaces\n- International Trade Tower: Commercial Complex\n- Holiday Inn: Hotel Suites, Office Space"
        ]
      },
      {
        "tag": "commercial_properties_in_ludhiana",
        "patterns": [
          "What are the commercial properties available in Ludhiana?",
          "Can you list the commercial properties in Ludhiana?",
          "Tell me about the commercial properties in Ludhiana."
        ],
        "responses": [
          "There are commercial properties available in Ludhiana including:\n- Royal Street Sector Satara: Booth, Shop, SCOs & Service Studio\n- Omaxe Plaza: Multiplex & Shops\n- Omaxe Royal Arcade: Shops & Multiplex"
        ]
      },
      {
        "tag": "commercial_properties_in_lucknow",
        "patterns": [
          "What are the commercial properties available in Lucknow?",
          "Can you list the commercial properties in Lucknow?",
          "Tell me about the commercial properties in Lucknow."
        ],
        "responses": [
          "There are commercial properties available in Lucknow including:\n- Omaxe Hi Street: Hotel Suites\n- Omaxe Hazratganj Phase II: Shops & Service Apartments, Offices\n- Omaxe Hazratganj: Shops & Service Apartments, Offices"
        ]
      },
      {
        "tag": "commercial_properties_in_faridabad",
        "patterns": [
          "What are the commercial properties available in Faridabad?",
          "Can you list the commercial properties in Faridabad?",
          "Tell me about the commercial properties in Faridabad."
        ],
        "responses": [
          "There are commercial properties available in Faridabad including:\n- Omaxe Hi Fun: 10 screen multiplex, Gaming Zone, Food court, Showroom kiosk & Hypermarket\n- Royal Street: Retail Shops\n- World Street: Mixed Use Land\n- Omaxsun: Office Space"
        ]
      },
      {
        "tag": "commercial_properties_in_bahadurgarh",
        "patterns": [
          "What are the commercial properties available in Bahadurgarh?",
          "Can you list the commercial properties in Bahadurgarh?",
          "Tell me about the commercial properties in Bahadurgarh."
        ],
        "responses": [
          "There are commercial properties available in Bahadurgarh including:\n- Omaxe Galleria: Retails Shops, Ofiice Spaces & Service Flats\n- Omaxe City Gate: Shops, Offices & Service Apartments"
        ]
      },
      {
        "tag": "commercial_properties_in_gurugram",
        "patterns": [
          "What are the commercial properties available in Gurugram?",
          "Can you list the commercial properties in Gurugram?",
          "Tell me about the commercial properties in Gurugram."
        ],
        "responses": [
          "There are commercial properties available in Gurugram including:\n- Omaxe Celebrations Mall: Multiplex, Retail & Food Court\n- Omaxe Gurgaon Mall: Multiplex, Retail Shops & Food Court\n- Omaxe City Centre: Commercial Space"
        ]
      },
      {
        "tag": "commercial_properties_in_greater_noida",
        "patterns": [
          "What are the commercial properties available in Greater Noida?",
          "Can you list the commercial properties in Greater Noida?",
          "Tell me about the commercial properties in Greater Noida."
        ],
        "responses": [
          "There are commercial properties available in Greater Noida including:India Trade Center: Retail, Office & Serviced Apartments\n- Omaxe Palm Court: Commercial Space\n- Omaxe Arcade: Commercial Complex\n- NRI City Center: Multiplex, Retail Shops, Food Court & Fun Zone\n- Omaxe Connaught Place: Multiplex, Retail Shops, Office Space, Food Court, Fun Zone & Theme Park"
        ]
      },
      {
        "tag": "commercial_properties_in_patiala",
        "patterns": [
          "What are the commercial properties available in Patiala?",
          "Can you list the commercial properties in Patiala?",
          "Tell me about the commercial properties in Patiala."
        ],
        "responses": [
          "There are commercial properties available in Patiala including:\n- Omaxe Mall: Multiplex, Retail & Food Court"
        ]
      },
      {
        "tag": "commercial_properties_in_amritsar",
        "patterns": [
          "What are the commercial properties available in Amritsar?",
          "Can you list the commercial properties in Amritsar?",
          "Tell me about the commercial properties in Amritsar."
        ],
        "responses": [
          "There are commercial properties available in Amritsar including:\n- Omaxe Value Mall: Multiplex, Retail Shops & Food Court\n- Omaxe Novelty Mall: Shopping Complex"
        ]
      },
      {
        "tag": "commercial_properties_in_sonepat",
        "patterns": [
          "What are the commercial properties available in Sonepat?",
          "Can you list the commercial properties in Sonepat?",
          "Tell me about the commercial properties in Sonepat."
        ],
        "responses": [
          "There are commercial properties available in Sonepat including:\n- Omaxe City- Omaxe Plaza: Shops, Offices & Food Court"
        ]
      },
      {
        "tag": "commercial_properties_in_agra",
        "patterns": [
          "What are the commercial properties available in Agra?",
          "Can you list the commercial properties in Agra?",
          "Tell me about the commercial properties in Agra."
        ],
        "responses": [
          "There are commercial properties available in Agra including:\n- Omaxe SRK Mall: Multiplex, Retail & Food Court"
        ]
      },
      {
        "tag": "commercial_properties_in_indirapuram",
        "patterns": [
          "What are the commercial properties available in Indirapuram?",
          "Can you list the commercial properties in Indirapuram?",
          "Tell me about the commercial properties in Indirapuram."
        ],
        "responses": [
          "There are commercial properties available in Indirapuram including:\n- Omaxe Plaza Indirapuram: Mall"
        ]
      },
      {
        "tag": "commercial_properties_in_jaipur",
        "patterns": [
          "What are the commercial properties available in Jaipur?",
          "Can you list the commercial properties in Jaipur?",
          "Tell me about the commercial properties in Jaipur."
        ],
        "responses": [
          "There are commercial properties available in Jaipur including:\n- Omaxe Central Market RC-7: Shops\n- Omaxe Shubhangan Street Market: Shopping Complex\n- Omaxe City Street Market: Retail Shops"
        ]
      },
      {
        "tag": "nature_of_business",
        "patterns": [
          "What are the nature of businesses available?",
          "Can you list the nature of businesses?",
          "Tell me about the nature of businesses."
        ],
        "responses": [
          "Nature of Business:\n- Civil Works:\n  - Civil structure work only\n  - Complete Civil work including Furnishing, plumbing, and electrical works\n  - Piling\n  - Dewatering\n  - Nailing/Soil Stabilisation\n  - Waterproofing\n  - Stone Flooring/Cladding\n  - Internal Painting\n  - Texture\n  - POP False Ceiling\n  - Grid False Ceiling\n  - Structural Glazing/ACP\n  - Interior Works\n  - SS Railing\n  - Glass Works\n  - uPVC Doors/Windows\n  - M.S.Gate, Grills, Railings\n  - Any Other Not Mentioned Above\n- External Development:\n  - Road Work (WBM)\n  - Premix Carpeting\n  - Sewerage and Draining\n  - External Clarification\n  - STP\n  - WTP\n  - OHT/UGT\n  - Any Other Not Mentioned Above\n- Service Works:\n  - Air Conditioning (Low Side)\n  - Mechanical Ventilation\n  - Fire Fighting\n  - Any Other Not Mentioned Above\n\nImportant Instructions:\n- Validity of the V.R FORM is 2 YEARS from the date of issue.\n- The V.R FORM is to be completed in all respects. if any item is not relevant, please write 'Not Applicable (NA)'.\n- Submission of incomplete application/short receipt of documents shall be sufficient cause for outright rejection and no further correspondence shall be entertained.\n- Physical verification of facilities as well as statement made/Submitted will be carried out as necessary. Misinformation, if any, will make the registration liable to be cancelled.\n- Quote VRN in all future correspondences.\n- Kindly enclose all relevant documents."
        ]
      },
      {
        "tag": "omaxe_care",
        "patterns": [
          "What services are provided under Omaxe Care?",
          "Can you list the services offered by Omaxe Care?",
          "Tell me about Omaxe Care services."
        ],
        "responses": [
          "Omaxe Care offers the following services:\n- Business Associate\n- Vendors\n- Buyers Guide"
        ]
      },
      {
        "tag": "omaxe_care",
        "patterns": [
          "What services are provided under Omaxe Care?",
          "Can you list the services offered by Omaxe Care?",
          "Tell me about Omaxe Care services."
        ],
        "responses": [
          "Omaxe Care offers the following services:",
          "- Business Associate: Join as a business associate with Omaxe.",
          "- Vendors: Become a reliable supplier/merchant for Omaxe projects.",
          "- Buyers Guide: Get assistance and guidance for purchasing properties with Omaxe."
        ]
      },
      {
        "tag": "New_Chandigarh",
        "patterns": [
          "What residential properties are available in New Chandigarh?",
          "List properties in New Chandigarh",
          "What types of properties can I find in New Chandigarh?"
        ],
        "response": "In New Chandigarh, you can find various residential properties including apartments, penthouses, independent floors, and duplexes."
      },
      {
        "tag": "Ludhiana",
        "patterns": [
          "What residential properties are available in Ludhiana?",
          "List properties in Ludhiana",
          "What types of properties can I find in Ludhiana?"
        ],
        "response": "In Ludhiana, there are different types of residential properties available such as independent floors, villas, apartments, and penthouses."
      },
      {
        "tag": "Lucknow",
        "patterns": [
          "What residential properties are available in Lucknow?",
          "List properties in Lucknow",
          "What types of properties can I find in Lucknow?"
        ],
        "response": "In Lucknow, you can explore a variety of residential options including apartments, penthouses, plots, and villas."
      },
      {
        "tag": "Omaxe World Street",
        "patterns": [
          "Omaxe World Street",
          "What is special about Omaxe World Street?"
        ],
        "responses": [
          "Omaxe World Street is a themed high street destination with influences from famous shopping streets like London, Athens, and Amsterdam.Recognized as the Best Retail Project at the Estatesmen Awards 2021, Omaxe World Street offers a unique shopping and dining experience. Omaxe World Street features open spaces, restaurants, cafes, and a visually delightful backdrop, making it a perfect destination for shoppers and food enthusiasts."
        ]
      },
      {
        "tag": "About Omaxe",
        "patterns": [
            "About Omaxe",
            "About Omaxe Group",
            "Who is Omaxe?",
            "Tell me about Omaxe"
        ],
        "responses": [
            "Omaxe Group has been helping customers, both families and corporates, achieve their dream realty space for over thirty years. The Group is now one of the top builders in India and the most trusted brand in real estate. With over three decades of experience and 12.01 million Sq.Mtr(129.25 million sq.ft.) of delivered space in real estate and construction contracting, Omaxe is today one of Indias leading and trusted real estate companies. The brand Omaxe was founded in 1987 by visionary first-generation entrepreneur & civil engineer Mr. Rohtas Goel to undertake construction and contracting business. Subsequently, the company diversified into real estate sector in 2001 and got listed on both stock exchanges (BSE and NSE) in 2007."
        ]
    },
    {
        "tag": "Company Information",
        "patterns": [
            "Company Information",
            "Overview - CIN number",
            "Board of Directors and KMPs",
            "COI, MOA & AOA and Prospectus",
            "Share Price"
        ],
        "responses": [
            "Company Information: Overview - CIN number, Board of Directors and KMPs, COI, MOA & AOA and Prospectus, Share Price"
        ]
    },
    {
        "tag": "Investor Disclosures",
        "patterns": [
            "Disclosures Under Regulation 46 of The SEBI (LODR) Regulations",
            "Details of Business",
            "Terms and Conditions of Appointment of Independent Directors",
            "Composition of Committees of Board of Directors",
            "Code of Conduct of Board of Directors and Senior Managerial Personnel"
        ],
        "responses": [
            "Investor Disclosures: Disclosures Under Regulation 46 of The SEBI (LODR) Regulations, Details of Business, Terms and Conditions of Appointment of Independent Directors, Composition of Committees of Board of Directors, Code of Conduct of Board of Directors and Senior Managerial Personnel"
        ]
    },
    {
        "tag": "Contact Details",
        "patterns": [
            "Contact Details",
            "Registrar & Share Transfer Agent",
            "Chief Financial Officer",
            "Company Secretary & Nodal Officer",
            "Registered Office and Corporate Office Address"
        ],
        "responses": [
            "Contact Details: Registrar & Share Transfer Agent, Chief Financial Officer, Company Secretary & Nodal Officer, Registered Office and Corporate Office Address"
        ]
    }
,

    {
        "tag": "Financial Information",
        "patterns": [
            "Financial Information",
            "Notice of Board Meeting",
            "Financial Results",
            "Annual Reports",
            "Shareholding Pattern"
        ],
        "responses": [
            "Financial Information: Notice of Board Meeting, Financial Results, Annual Reports, Shareholding Pattern"
        ]
    },
    {
        "tag": "Other Disclosures Under SEBI Regulations",
        "patterns": [
            "Other Disclosures Under SEBI Regulations",
            "Other Codes & Policies",
            "Periodic Compliances",
            "Disclosure of Reasons for Encumbrances"
        ],
        "responses": [
            "Other Disclosures Under SEBI Regulations: Other Codes & Policies, Periodic Compliances, Disclosure of Reasons for Encumbrances"
        ]
    },
    {
        "tag": "Dividend & IEPF Details",
        "patterns": [
            "Dividend & IEPF Details",
            "Unpaid Dividend",
            "IEPF",
            "Procedure"
        ],
        "responses": [
            "Dividend & IEPF Details: Unpaid Dividend, IEPF, Procedure"
        ]
    },
    {
        "tag": "Quick Links",
        "patterns": [
            "Quick Links",
            "Privacy Policy",
            "Terms & Conditions",
            "Disclaimer",
            "Sitemap"
        ],
        "responses": [
            "Quick Links: Privacy Policy, Terms & Conditions, Disclaimer, Sitemap"
        ]
    }
,


    {
        "tag": "Residential Properties",
        "patterns": [
            "Residential Properties",
            "Property In New Chandigarh",
            "Property In Ludhiana",
            "Property In Lucknow",
            "Property In Prayagraj"
        ],
        "responses": [
            "Residential Properties: Property In New Chandigarh, Property In Ludhiana, Property In Lucknow, Property In Prayagraj"
        ]
    },
    {
        "tag": "Commercial Properties",
        "patterns": [
            "Commercial Properties",
            "Commercial Properties In New Delhi",
            "Commercial Properties In New Chandigarh",
            "Commercial Properties In Ludhiana",
            "Commercial Properties In Lucknow"
        ],
        "responses": [
            "Commercial Properties: Commercial Properties In New Delhi, Commercial Properties In New Chandigarh, Commercial Properties In Ludhiana, Commercial Properties In Lucknow"
        ]
    },
    {
        "tag": "Career Opportunities",
        "patterns": [
            "Career Opportunities",
            "Life At Omaxe",
            "Current Opening"
        ],
        "responses": [
            "Career Opportunities: Life At Omaxe, Current Opening"
        ]
    },
    {
        "tag": "Social Media Links",
        "patterns": [
            "Lets go Social",
            "Join as Business Associate"
        ],
        "responses": [
            "Social Media Links: Lets go Social, Join as Business Associate"
        ]
    }
,


    {
        "tag": "Media Coverage",
        "patterns": [
            "Media Coverage",
            "Press Releases",
            "E-Coverages",
            "Print Coverages",
            "Events",
            "Media Kit",
            "Videos"
        ],
        "responses": [
            "Media Coverage: Press Releases, E-Coverages, Print Coverages, Events, Media Kit, Videos"
        ]
    },
    {
        "tag": "About Us",
        "patterns": [
            "About Us",
            "Leadership Team",
            "CMD Message",
            "Quality Policy",
            "Awards & Honors",
            "Mission & Vision",
            "Success Story"
        ],
        "responses": [
            "About Us: Leadership Team, CMD Message, Quality Policy, Awards & Honors, Mission & Vision, Success Story"
        ]
    },
    {
        "tag": "Project Location",
        "patterns": [
            "Project Location",
            "Property In New Delhi",
            "Property In Ludhiana",
            "Property In Lucknow",
            "Property In Prayagraj"
        ],
        "responses": [
            "Project Location: Property In New Delhi, Property In Ludhiana, Property In Lucknow, Property In Prayagraj"
        ]
    },
    {
        "tag": "Contact Details",
        "patterns": [
            "Contact Details"
        ],
        "responses": [
            "Contact Details"
        ]
    },
    {
        "tag": "Company Information",
        "patterns": [
            "Company Information",
            "Overview - CIN number",
            "Board of Directors and KMPs",
            "COI, MOA & AOA and Prospectus",
            "Share Price"
        ],
        "responses": [
            "Company Information: Overview - CIN number, Board of Directors and KMPs, COI, MOA & AOA and Prospectus, Share Price"
        ]
    },
    {
        "tag": "Registrar & Share Transfer Agent",
        "patterns": [
            "Registrar & Share Transfer Agent",
            "Link Intime India Private Limited"
        ],
        "responses": [
            "Registrar & Share Transfer Agent: Link Intime India Private Limited"
        ]
    },
    {
        "tag": "Chief Financial Officer",
        "patterns": [
            "Chief Financial Officer",
            "Mr. Manoj Kumar Dua"
        ],
        "responses": [
            "Chief Financial Officer: Mr. Manoj Kumar Dua"
        ]
    },
    {
        "tag": "Company Secretary & Nodal Officer",
        "patterns": [
            "Company Secretary & Nodal Officer",
            "Mr. Vikas Khandelwal"
        ],
        "responses": [
            "Company Secretary & Nodal Officer: Mr. Vikas Khandelwal"
        ]
    },
    {
        "tag": "Registered Office and Corporate Office Address",
        "patterns": [
            "Registered Office and Corporate Office Address",
            "Registered Office: Shop No. 19B, First Floor, Omaxe Celebration Mall, Sohna Road, Gurugram, Haryana - 122001",
            "Corporate Office: Omaxe House, 7, Local Shopping Centre, Kalkaji, New Delhi - 110019"
        ],
        "responses": [
            "Registered Office and Corporate Office Address: Registered Office - Shop No. 19B, First Floor, Omaxe Celebration Mall, Sohna Road, Gurugram, Haryana - 122001, Corporate Office - Omaxe House, 7, Local Shopping Centre, Kalkaji, New Delhi - 110019"
        ]
    },
    {
        "tag": "SEBI Disclosures",
        "patterns": [
            "Disclosures Under Regulation 46 of The SEBI (LODR) Regulations",
            "SEBI Disclosures"
        ],
        "responses": [
            "SEBI Disclosures: Disclosures Under Regulation 46 of The SEBI (LODR) Regulations"
        ]
    },
    {
        "tag": "Other Disclosures Under SEBI Regulations",
        "patterns": [
            "Other Disclosures Under SEBI Regulations",
            "Other Codes & Policies",
            "Periodic Compliances",
            "Disclosure of Reasons for Encumbrances"
        ],
        "responses": [
            "Other Disclosures Under SEBI Regulations: Other Codes & Policies, Periodic Compliances, Disclosure of Reasons for Encumbrances"
        ]
    },
    {
        "tag": "Dividend & IEPF Details",
        "patterns": [
            "Dividend & IEPF Details",
            "Unpaid Dividend",
            "IEPF",
            "Others-Procedure"
        ],
        "responses": [
            "Dividend & IEPF Details: Unpaid Dividend, IEPF, Others-Procedure"
        ]
    },
    {
        "tag": "Media Coverage",
        "patterns": [
            "Details of Media Agreements",
            "Newspaper Publications under Reg. 47(1)"
        ],
        "responses": [
            "Media Coverage: Details of Media Agreements, Newspaper Publications under Reg. 47(1)"
        ]
    },
    {
        "tag": "Financial Information",
        "patterns": [
            "Notice of Board Meeting",
            "Financial Results",
            "Annual Reports",
            "Shareholding Pattern",
            "Financial Information",
            "Notices to Shareholders",
            "Credit Ratings",
            "Audited Financial Statements of Subsidiary Companies",
            "Annual Secretarial Compliance Report"
        ],
        "responses": [
            "Financial Information: Notice of Board Meeting, Financial Results, Annual Reports, Shareholding Pattern, Notices to Shareholders, Credit Ratings, Audited Financial Statements of Subsidiary Companies, Annual Secretarial Compliance Report"
        ]
    },
    {
        "tag": "Event Outcome",
        "patterns": [
            "Outcome of Board Meetings",
            "Change in Directors, KMP, Auditor and Compliance Officer",
            "AGM/EGM & Postal Ballot",
            "Other Disclosures"
        ],
        "responses": [
            "Event Outcome: Outcome of Board Meetings, Change in Directors, KMP, Auditor and Compliance Officer, AGM/EGM & Postal Ballot, Other Disclosures"
        ]
    },
    {
        "tag": "Grievance Redressal",
        "patterns": [
            "Email address for grievance redressal and other relevant details",
            "Contact information of the designated officials w.r.t. investor grievances"
        ],
        "responses": [
            "Grievance Redressal: Email address for grievance redressal and other relevant details, Contact information of the designated officials w.r.t. investor grievances"
        ]
    },
    {
        "tag": "Policy Details",
        "patterns": [
            "Vigil Mechanism/ Whistle Blower Policy",
            "Criteria of making payments to Non-Executive Directors",
            "Policy on dealing with related party transactions",
            "Policy for determining material subsidiaries",
            "Policy for determination of materiality of events under Reg. 30(4)",
            "Dividend Distribution Policy"
        ],
        "responses": [
            "Policy Details: Vigil Mechanism/ Whistle Blower Policy, Criteria of making payments to Non-Executive Directors, Policy on dealing with related party transactions, Policy for determining material subsidiaries, Policy for determination of materiality of events under Reg. 30(4), Dividend Distribution Policy"
        ]
    },
    {
        "tag": "Additional Documents",
        "patterns": [
            "COI, MOA & AOA and Prospectus",
            "Notice of Board Meeting",
            "Financial Results",
            "Annual Reports",
            "Audited Financial Statements of Subsidiary Companies",
            "Annual Secretarial Compliance Report"
        ],
        "responses": [
            "Additional Documents: COI, MOA & AOA and Prospectus, Notice of Board Meeting, Financial Results, Annual Reports, Audited Financial Statements of Subsidiary Companies, Annual Secretarial Compliance Report"
        ]
    }
      

    ]
    
}    